{
  version: 1,
  config: {
    /*
     * There can be entries here for:
     *
     * - `class`: for tables, composite types, views and materialized views
     * - `attribute`: for columns/attributes (of any 'class' type)
     * - `constraint`: for table constraints
     * - `procedure`: for functions/procedures
     */
    class: {
        categories:{
            description: "Categories used to reference an ad. A category can have a parent category. NOTA: the site is planned to work with a two-level category hierarchy.",
            // tags:{
            //     omit: "delete"
            // }
        },
      companies: {
        description: "A company within the platform. Each user must reference a company. The company information must be filled before posting ad on the platform.",
        tags: {
            omit: "create,delete"
        },
        attribute: {
          siret: {
            description: "The SIRET number of the company",
          },
        },
      },
      company_status:{
          description: "A company has a status that must be selected during registration. The status indicates what kind of company it is.",
          tags: {omit: "delete"}
      },
      users:{
          description: "Defines a single user of the platform. The user is free to browse the platform and conclude deals as long as he validated his email address",
          tags: {omit: "create"}
      },
      countries:{
          description: "All the countries referenced in the address table",
          tags: {omit: "create,delete,update"}
      },
      administratives:{
          description: "All the administrative areas referenced in the address table",
          tags: {omit: "create,delete,update"}
      },
      counties:{
          description: "All the counties referenced in the address table",
          tags: {omit: "create,delete,update"}
      },
      cities:{
          description: "All the cities referenced in the address table",
          tags: {omit: "create,delete,update"}
      },
      address:{
          description: "All address referenced in the platform. Address are used to locate an ad, or a company. Address can be modified to ensure a company can define its exact address",
          tags: {omit: "create,delete"}
      },
      ads:{
          description: "The platform is intended to allow users to post ads. Ads can be of three types: 'SALE', 'RENT' or 'SERVICE'./nDepending on the type of the ad, different information can be required. Ads are a little complex compared to many other sites. They can include:\n- a quantity\n- options (with different price types depending on the ad type)\n- requirements: if the ad is of type RENT, the seller can ask for a fixed amount related to some requirements, no matter the duration of the rent",
          tags: {omit: "delete"}
      },
      ad_picture:{
          description: "An ad has an array of pictures related to it. As we used the postgraphile file upload plugin that does not support file arrays upload, we separated the pictures in a different table.",
          tags: {omit: "all,update,delete"}
      },
      cart_items:{
          description: "Each user can \"add to cart\". This action results in creating a cart item. When the user validates his cart, all of the cart items in his validated cart can now be considered as purchase intent. The seller is eventually free to consent or refuse the transaction. A cart item is a little complex as it includes a quantity, but also option quantities. To create a cart item, you must use the addToCart function, to ensure consistency of the cart item.",
          tags: {omit: "create"}
      },
      favorites:{
          description: "Favs of the user. Added or removed using mutation `addToFavorites`.",
          tags:{ omit: "create,update,delete"}
      },
      messages: {
          description: "All the messages exchanged through the platform. A message can be of type:\n- MESSAGE: it is a regular message with text content\n- FILE: it contains a link to a file\n- PICTURE: it contains a picture and a description\n- INTENT: it relates to a cart item. This kind of message is automatically triggered when a user validates his cart\n- CONFIRMATION/REFUSAL: the seller accepted / refused the offer",
          tags: {omit: "update,delete"}
      }

    },
    procedure: {
        send_message: {
            description: "Send a message and upsert corresponding conversation",
            tags: {
                arg0variant: "patch"
            },
        },
        post_ad: {
            description: "Creates an ad and the corresponding options, slots and requirements",
            tags: {
                arg0variant: "patch",
                arg1variant: "patch",
                arg2variant: "patch",
                arg3variant: "patch",
                arg5variant: "patch",

            }
        },
        add_to_cart: {
            description: "add an item to cart or update it if the users already creates a cart item for this product",
            tags: {
                arg0variant: "patch",
                arg1variant: "patch",
                arg2variant: "patch"
            }
        }
    }
  },
}